In [83]:
from sklearn.tree import *
from sklearn.linear_model import *
import pandas as pd

data = pd.read_csv('HistoricalPrices.csv')
data

        Date   Open   High    Low   Close
0   06/17/22  29913  30168  29653   29889
1   06/16/22  30306  30306  29740   29927
2   06/15/22  30570  31012  30185   30669
3   06/14/22  30592  30691  30144   30365
4   06/13/22  31145  31145  30374   30517
..       ...    ...    ...    ...     ...
58  03/25/22  34702  34943  34632   34861
59  03/24/22  34407  34714  34355   34708
60  03/23/22  34749  34749  34353   34358
61  03/22/22  34583  34882  34583   34807
62  03/21/22  34670  34808  34342   34553

[63 rows x 5 columns]

In [84]:
X = data.drop(columns=['Date'])
del X[' Close']
X

     Open   High    Low
0   29913  30168  29653
1   30306  30306  29740
2   30570  31012  30185
3   30592  30691  30144
4   31145  31145  30374
..    ...    ...    ...
58  34702  34943  34632
59  34407  34714  34355
60  34749  34749  34353
61  34583  34882  34583
62  34670  34808  34342

[63 rows x 3 columns]

In [85]:
Y = data[' Close']
Y

0     29889
1     29927
2     30669
3     30365
4     30517
      ...
58    34861
59    34708
60    34358
61    34807
62    34553
Name:  Close, Length: 63, dtype: int64

In [87]:
model = DecisionTreeClassifier()
model.fit(X, Y)
predictions = model.predict([ [29913, 30150, 29687], [29957, 30001, 29944] ])
predictions

array([29889, 29889])